app/controllers/addresses_controller.rb

    def create
      @contact.address = Address.new(address_params)
      if @contact.save
---
INSERT INTO "addresses" ("street", "city", "contact_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["street", "teste teste s/n Avenida Marcia"], ["city", "Jaboticaba teste teste"], ["contact_id", 100], ["created_at", 2020-03-19 13:30:47 UTC], ["updated_at", 2020-03-19 13:30:47 UTC]]

    def update
      if @contact.address.update(address_params)
---
UPDATE "addresses" SET "street" = ?, "city" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["street", "123456 s/n Avenida Marcia"], ["city", "Jaboticaba 123456"], ["updated_at", 2020-03-19 13:19:34 UTC], ["id", 5]]

    def destroy
      @contact.address.destroy
---
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 109]]

    def set_contact
        @contact = Contact.find(params[:contact_id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 100], ["LIMIT", 1]]