app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.all
---
SELECT "contacts".* FROM "contacts"

  def create
    @contact = Contact.new(contact_params)

    if @contact.save
---
INSERT INTO "contacts" ("name", "email", "birthdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Diarion Boneviti"], ["email", "diarim@bonevitti.cpm"], ["birthdate", Fri, 28 Jul 2000], ["created_at", 2020-03-08 19:13:47 UTC], ["updated_at", 2020-03-08 19:13:47 UTC]]

  def update
    if @contact.update(contact_params)
---
UPDATE "contacts" SET "name" = ?, "email" = ?, "kind_id" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["name", "Gabriel Ribeiro Guerreiro Diarion"], ["email", "gabriel.api@rutherford.com"], ["kind_id", 3], ["updated_at", 2020-03-19 01:03:16 UTC], ["id", 104]]