app/controllers/kinds_controller.rb

  def index
    @kinds = Kind.all
---
SELECT "kinds".* FROM "kinds"

  def set_kind
    if params[:contact_id]
      @kind = Contact.find(params[:contact_id]).kind
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 103], ["LIMIT", 1]]
SELECT  "kinds".* FROM "kinds" WHERE "kinds"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]