app/controllers/phones_controller.rb

    def create
      @contact.phones << Phone.new(phone_params)
---
INSERT INTO "phones" ("number", "contact_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["number", "(12) 99325-8123"], ["contact_id", 100], ["created_at", 2020-03-20 16:33:04 UTC], ["updated_at", 2020-03-20 16:33:04 UTC]]

    def update
      phone = Phone.find(phone_params[:id])
      if phone.update(phone_params)
---
SELECT  "phones".* FROM "phones" WHERE "phones"."id" = ? LIMIT ?  [["id", 196], ["LIMIT", 1]]
UPDATE "phones" SET "number" = ?, "updated_at" = ? WHERE "phones"."id" = ?  [["number", "(12) xxxx-xxxx"], ["updated_at", 2020-03-20 16:44:18 UTC], ["id", 196]]

    def destroy
      phone = Phone.find(phone_params[:id])
      phone.destroy
---
SELECT  "phones".* FROM "phones" WHERE "phones"."id" = ? LIMIT ?  [["id", 296], ["LIMIT", 1]]
DELETE FROM "phones" WHERE "phones"."id" = ?  [["id", 296]]

    def set_contact
        @contact = Contact.find(params[:contact_id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]